examples/single_turbine/fixed/system/surfaces
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
#include        "../setup"


surfaces
{
type surfaces;
libs    ("libsampling.so");

interpolationScheme      cellPoint;

surfaceFormat   raw;

     fields         (U k p);

    surfaces
    (
   zNormal {
          type            cuttingPlane;
          planeType       pointAndNormal;
          pointAndNormalDict {
            point     (0 0 $zh);
            normal  (0 0 1);
          }
                  }
    );
}


// ************************************************************************* //
